---
kind: type
id: T:Autodesk.Revit.DB.Analysis.FieldValues
source: html/728c3aac-0a10-027d-95e5-eb08665561a6.htm
---
# Autodesk.Revit.DB.Analysis.FieldValues

Contains values corresponding to domain points.
 Each domain point may have an array of values, each corresponding to a separate "measurement" for which this value was calculated.

## Syntax (C#)
```csharp
public class FieldValues : IDisposable
```